'''
________________________________________________________________________________________________________________________________________________
________________________________________________________________________________________________________________________________________________

Faça um programa que leia um ângulo qualquer e mostre na tela o valor do seno, cosseno e tangente desse ângulo.
________________________________________________________________________________________________________________________________________________
________________________________________________________________________________________________________________________________________________
'''
import math
num = float(input('Digite um ângulo: '))
sen = math.sin(math.radians(num))
cos = math.cos(math.radians(num))
tan = math.tan(math.radians(num))
print('O ângulo {} graus tem o SENO de {:.2f} graus, o COSSEN0 de {:.2f} graus e a TANGENTE de {:.2f} graus'.format(num,sen,cos,tan))